programming/python/setup.org
#+Title: setup
#+OPTIONS: ^:nil num:nil author:nil email:nil creator:nil timestamp:nil

* centos
** installation
- python34.x86_64
- python34-tools.x86_64
- python34-pip.noarch

** adding modules
- sudo pip3 install /ModuleName/
  - pip3 install pyperclip
- pip3 install –U /ModuleName/ # upgrade
- import /ModuleName/ # in the interactive shell to check

** using the command line
- chmod 764 pw.py
- python3.4 ./pw.py email

** 3rd party modules
*** pyperclip
yum install xclip

*** pygame
#+BEGIN_EXAMPLE
  yum install the following
  - python34-devel.x86_64
  - mercurial.x86_64
  - SDL2_image-devel.x86_64
  - SDL2-devel.x86_64
  - SDL2_ttf-devel.x86_64
  - yum install SDL-devel

  pip3 install --user hg+http://bitbucket.org/pygame/pygame

  navigate to the /tmp directory
  - python3 config.py
  - python3 setup.py build
  - python3 setup.py install
#+END_EXAMPLE

* windows
#+BEGIN_EXAMPLE C:\Windows\pw.bat
  @py.exe C:\Python34\pw.py %*
  @pause
#+END_EXAMPLE
usage: win -R and typing pw <account name>
