programming/python/setup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>setup</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">setup</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">centos</a>
<ul>
<li><a href="#sec-1-1">installation</a></li>
<li><a href="#sec-1-2">adding modules</a></li>
<li><a href="#sec-1-3">using the command line</a></li>
<li><a href="#sec-1-4">3rd party modules</a>
<ul>
<li><a href="#sec-1-4-1">pyperclip</a></li>
<li><a href="#sec-1-4-2">pygame</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">windows</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">centos</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">installation</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>python34.x86_64
</li>
<li>python34-tools.x86_64
</li>
<li>python34-pip.noarch
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">adding modules</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>sudo pip3 install <i>ModuleName</i>
<ul class="org-ul">
<li>pip3 install pyperclip
</li>
</ul>
</li>
<li>pip3 install –U <i>ModuleName</i> # upgrade
</li>
<li>import <i>ModuleName</i> # in the interactive shell to check
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">using the command line</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>chmod 764 pw.py
</li>
<li>python3.4 ./pw.py email
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">3rd party modules</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1">pyperclip</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
yum install xclip
</p>
</div>
</div>

<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2">pygame</h4>
<div class="outline-text-4" id="text-1-4-2">
<pre class="example">
yum install the following
- python34-devel.x86_64
- mercurial.x86_64
- SDL2_image-devel.x86_64
- SDL2-devel.x86_64
- SDL2_ttf-devel.x86_64
- yum install SDL-devel

pip3 install --user hg+http://bitbucket.org/pygame/pygame

navigate to the /tmp directory
- python3 config.py
- python3 setup.py build
- python3 setup.py install
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">windows</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
@py.exe C:\Python34\pw.py %*
@pause
</pre>
<p>
usage: win -R and typing pw &lt;account name&gt;
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
